<?php

namespace Database\Seeders;

use App\Models\Glossary\CalendarEventStatus;
use App\Models\Glossary\CalendarGeneratorRulePeriod;
use App\Models\Glossary\CalendarGeneratorRuleStatus;
use App\Models\Glossary\Payment;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CalendarSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        ### GENERATOR
        ##################################################
        ### PERIOD
        CalendarGeneratorRulePeriod::create(['code' => 'daily',        'name'=> 'Ежедневно',       'step' => '1 day'      ]);
        CalendarGeneratorRulePeriod::create(['code' => 'weekly',       'name'=> 'Еженедельно',     'step' => '1 week'     ]);
        CalendarGeneratorRulePeriod::create(['code' => 'monthly',      'name'=> 'Ежемесячно',      'step' => '1 month'    ]);
        CalendarGeneratorRulePeriod::create(['code' => 'quarterly',    'name'=> 'Ежеквартально',   'step' => '1 quarter'  ]);
        CalendarGeneratorRulePeriod::create(['code' => 'yearly',       'name'=> 'Ежегодно',        'step' => '1 year'     ]);

        ### STATUS
        CalendarGeneratorRuleStatus::create(['code' => 'valid',     'name' => 'Действует'   ]);
        CalendarGeneratorRuleStatus::create(['code' => 'deleted',   'name' => 'Удалено'     ]);
        CalendarGeneratorRuleStatus::create(['code' => 'passed',    'name' => 'Устарело'    ]);

        ### EVENT
        ##################################################
        CalendarEventStatus::create(['code' => 'future',    'name' => 'Предстоящее' ]);
        CalendarEventStatus::create(['code' => 'opened',    'name' => 'Открыто'     ]);
        CalendarEventStatus::create(['code' => 'closed',    'name' => 'Закрыто'     ]);

        Payment::create(['code' => '020', 'name' => 'Областной материнский (семейный) капитал  51-ОЗ (улучшение жилищных условий)',                                                                                                                     'kbk' => '8881003021Р180010313']);
        Payment::create(['code' => '021', 'name' => 'Областной материнский (семейный) капитал  51-ОЗ (образование)',                                                                                                                                    'kbk' => '8881003021Р180010313']);
        Payment::create(['code' => '030', 'name' => 'ЕДВ отд. Кат.гр.  73-ОЗ от 09.07.2012',                                                                                                                                                            'kbk' => '8881004021Р150840313']);
        Payment::create(['code' => '040', 'name' => 'Пенсии Кемеровской области 8-ОЗ',                                                                                                                                                                  'kbk' => '88810030210080040313']);
        Payment::create(['code' => '050', 'name' => 'Пособие на ребенка  75-ОЗ',                                                                                                                                                                        'kbk' => '88810040210080050313']);
        Payment::create(['code' => '060', 'name' => 'ЕДВ 70-летним 74-ОЗ',                                                                                                                                                                              'kbk' => '88810030210080070313']);
        Payment::create(['code' => '070', 'name' => 'Денежная выплата отдельным категориям граждан 156-ОЗ',                                                                                                                                             'kbk' => '88810030210080090313']);
        Payment::create(['code' => '080', 'name' => 'Компенсация расходов на оплату ЖКУ 2-ОЗ',                                                                                                                                                          'kbk' => '88810030210080100321']);
        Payment::create(['code' => '090', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ 5-ФЗ от 12.01.1995',                                                                                                                                         'kbk' => '88810030210052500321']);
        Payment::create(['code' => '100', 'name' => 'ГДВ Почетным донорам РФ 450н',                                                                                                                                                                     'kbk' => '88810030210052200313']);
        Payment::create(['code' => '130', 'name' => 'ЕДВ ветераны труда ЗКО от 20.12.2004   № 105-ОЗ',                                                                                                                                                  'kbk' => '88810030210070010313']);
        Payment::create(['code' => '140', 'name' => 'ЕДВ Телефон ВТ ЗКО от 20.12.2004   № 105-ОЗ',                                                                                                                                                      'kbk' => '88810030210070010313']);
        Payment::create(['code' => '150', 'name' => 'ГДВ радиовещание ВТ  ЗКО от 20.12.2004   № 105-ОЗ',                                                                                                                                                'kbk' => '88810030210070010313']);
        Payment::create(['code' => '160', 'name' => 'ГДВ антенна ВТ ЗКО от 20.12.2004   № 105-ОЗ',                                                                                                                                                      'kbk' => '88810030210070010313']);
        Payment::create(['code' => '170', 'name' => 'ЕДВ труженики тыла ЗКО от 20.12.2004   № 105-ОЗ',                                                                                                                                                  'kbk' => '88810030210070020313']);
        Payment::create(['code' => '180', 'name' => 'ЕДВ пострадавшим от политических репрессий № 114-ОЗ от 20.12.2004',                                                                                                                                'kbk' => '88810030210070030313']);
        Payment::create(['code' => '190', 'name' => 'ДК пострадавшим от полит. репр. расходов за проезд по терр. РФ  № 114-ОЗ от 20.12.2004',                                                                                                           'kbk' => '88810030210070030321']);
        Payment::create(['code' => '200', 'name' => 'Денежная комп. на погреб. гр-ну, за организацию погребения № 11',                                                                                                                                  'kbk' => '88810030210070030313']);
        Payment::create(['code' => '210', 'name' => 'ЕДК взамен предоставления транспортного средства № 114-ОЗ от 20.12.2004',                                                                                                                          'kbk' => '88810030210070030313']);
        Payment::create(['code' => '220', 'name' => 'Ежекв. ДВ неполн. Мног. семьям, 3 и более детей, полным мног. семьям, 6 и более детей № 12',                                                                                                       'kbk' => '8881003021Р170050313']);
        Payment::create(['code' => '230', 'name' => 'Компенсация ЖКУ 30 процентов № 123-ОЗ от 14.11.2005',                                                                                                                                              'kbk' => '8881003021Р170050321']);
        Payment::create(['code' => '250', 'name' => 'ЕДВ 1000 многодетным № 123-ОЗ от 14.11.2005',                                                                                                                                                      'kbk' => '8881003021Р170050313']);
        Payment::create(['code' => '251', 'name' => 'Ежегодная выплата на одежду многодетным семьям № 123-ОЗ от 14.11.2005',                                                                                                                            'kbk' => '8881003021Р170050321']);
        Payment::create(['code' => '260', 'name' => 'Компенсация ЖКУ в размере 50 %  № 14-ОЗ от 08.04.2008 Многодетные матери',                                                                                                                         'kbk' => '88810030210070060321']);
        Payment::create(['code' => '270', 'name' => 'ГДВ антенна № 14-ОЗ от 08.04.2008 Многодетные матери',                                                                                                                                             'kbk' => '88810030210070060313']);
        Payment::create(['code' => '280', 'name' => 'ЕДВ телефон № 14-ОЗ от 08.04.2008 Многодетные матери',                                                                                                                                             'kbk' => '88810030210070060313']);
        Payment::create(['code' => '290', 'name' => 'ГДВ радиовещание № 14-ОЗ от 08.04.2008 Многодетные матери',                                                                                                                                        'kbk' => '88810030210070060313']);
        Payment::create(['code' => '300', 'name' => 'ЕДК ЖКУ отдельным категориям гр. № 15-ОЗ от 27.01.2006',                                                                                                                                           'kbk' => '88810030210070080313']);
        Payment::create(['code' => '310', 'name' => 'ЕДВ телефон отд. Кат. Гр-н № 15-ОЗ от 27.01.2005',                                                                                                                                                 'kbk' => '88810030210070080313']);
        Payment::create(['code' => '320', 'name' => 'ГДК ремонт ТС и ГСМ  отд. Кат. Гр-н № 15-ОЗ от 27.01.2005',                                                                                                                                        'kbk' => '88810030210070080313']);
        Payment::create(['code' => '330', 'name' => 'Комп. Сан. кур. Леч. КО отд. Кат. Гр-н № 15-ОЗ от 27.01.2006',                                                                                                                                     'kbk' => '88810030210070080321']);
        Payment::create(['code' => '340', 'name' => 'Комп. ЖКУ отд. Кат. Гр-н № 15-ОЗ от 27.01.2007',                                                                                                                                                   'kbk' => '88810030210070080321']);
        Payment::create(['code' => '350', 'name' => 'Комп. ЖКУ 50% приемным родителям 9-ОЗ от 07.02.2013',                                                                                                                                              'kbk' => '88810030210070070321']);
        Payment::create(['code' => '360', 'name' => 'ГДВ антенна приемным родителям 9-ОЗ от 07.02.2014',                                                                                                                                                'kbk' => '88810030210070070313']);
        Payment::create(['code' => '370', 'name' => 'ЕДВ телефон приемным родителям 9-ОЗ от 07.02.2015',                                                                                                                                                'kbk' => '88810030210070070313']);
        Payment::create(['code' => '380', 'name' => 'ГДВ радиовещание приемным родителям 9-ОЗ от 07.02.2014',                                                                                                                                           'kbk' => '88810030210070070313']);
        Payment::create(['code' => '400', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 122-ФЗ от 22.08.2004',                                                                                                                                     'kbk' => '88810030210052500321']);
        Payment::create(['code' => '410', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 181-ФЗ от 24.11.1995',                                                                                                                                     'kbk' => '88810030210052500321']);
        Payment::create(['code' => '420', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 1244-1 от 15.05.1991',                                                                                                                                     'kbk' => '88810030210052500321']);
        Payment::create(['code' => '430', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 2-ФЗ от 10.01.2002',                                                                                                                                       'kbk' => '88810030210052500321']);
        Payment::create(['code' => '440', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 175-ФЗ от 26.11.1998',                                                                                                                                     'kbk' => '88810030210052500321']);
        Payment::create(['code' => '450', 'name' => 'Компенсация расходов на оплату ЖКУ ФЗ № 2123-1 от 27.12.1991',                                                                                                                                     'kbk' => '88810030210052500321']);
        Payment::create(['code' => '530', 'name' => 'Ежемес. допл. к пенсии совет старейшин при Губернаторе КО ЗКО от 8 апреля 2008 года № 16-ОЗ',                                                                                                      'kbk' => '88810030210080030312']);
        Payment::create(['code' => '540', 'name' => 'Компенсация инвалидам по зрению абонентской платы за телефон, ЗКО от 14.02.2005г. № 25-ОЗ',                                                                                                        'kbk' => '88810030210070040321']);
        Payment::create(['code' => '550', 'name' => 'Компенсация инвалидам по зрению установка телефона, ЗКО от 14.02.2005г. № 25-ОЗ',                                                                                                                  'kbk' => '88810030210070040321']);
        Payment::create(['code' => '560', 'name' => 'Единовременное пособие 157-ФЗ "Об иммунопрофилактике инфекционных болезней"',                                                                                                                      'kbk' => '88810030210052400313']);
        Payment::create(['code' => '570', 'name' => 'ЕДВ 157-ФЗ "Об иммунопрофилактике инфекционных болезней"',                                                                                                                                         'kbk' => '88810030210052400313']);
        Payment::create(['code' => '580', 'name' => 'ГДВ (до прожиточного) 140-ОЗ, ГСП малоимущим семьям и малоимущим одиноко проживающим гражданам',                                                                                                   'kbk' => '88810030210080080313']);
        Payment::create(['code' => '590', 'name' => 'ГДВ (приобретение угля) 140-ОЗ, ГСП малоимущим семьям и малоимущим одиноко проживающим гражданам',                                                                                                 'kbk' => '88810030210080080313']);
        Payment::create(['code' => '601', 'name' => 'Пособие (Социальный контракт) 140-ОЗ, ГСП малоимущим семьям и малоимущим одиноко проживающим граждан 2021',                                                                                        'kbk' => '888100602100R4040313']);
        Payment::create(['code' => '620', 'name' => '50% компенсация за капитальный ремонт 108-ОЗ',                                                                                                                                                     'kbk' => '888100302100R4620321']);
        Payment::create(['code' => '630', 'name' => '100% компенсация за капитальный ремонт 108-ОЗ',                                                                                                                                                    'kbk' => '888100302100R4620321']);
        Payment::create(['code' => '630_1', 'name' => '108-ОЗ обласной бюджет',                                                                                                                                                                         'kbk' => '88810030210073870321']);
        Payment::create(['code' => '650', 'name' => 'ЕДВ лицу, организовавшему приемную семью 131-ОЗ',                                                                                                                                                  'kbk' => '88810030210070130321']);
        Payment::create(['code' => '660', 'name' => 'ПК АКО 468 Социальная поддержка населения Кузбасса',                                                                                                                                               'kbk' => '88810030210070140321']);
        Payment::create(['code' => '670', 'name' => '50-ОЗ "О пенсиях за выслугу лет лицам, замещавшим гос. должности',                                                                                                                                 'kbk' => '88810019900079110312']);
        Payment::create(['code' => '680', 'name' => '51-ОЗ "О пенсии за выслугу лет лицам, работавшим в органах государственной власти и управления, общественных и политических организациях Кемеровской области"',                                    'kbk' => '88810019900079110312']);
        Payment::create(['code' => '690', 'name' => '№ 138-ОЗ "О дополнительной мере социальной поддержки граждан в целях соблюдения предельных (максимальных) индексов изменения размера вносимой гражданами платы за коммунальные услуги"',           'kbk' => '88810030210070100321']);
        Payment::create(['code' => '701', 'name' => '7-ОЗ Обеспечение полноценным питанием беременных женщин при сроке беременности свыше 12 недель',                                                                                                   'kbk' => '88810030180072340313']);
        Payment::create(['code' => '702', 'name' => '7-ОЗ Обеспечение полноценным питанием кормящих матерей при грудном вскармливании до достижения ребенком возраста одного года',                                                                     'kbk' => '88810030180072340313']);
        Payment::create(['code' => '703', 'name' => '7-ОЗ Обеспечение полноценным питанием  детей в возрасте до трех лет ',                                                                                                                             'kbk' => '88810030180072340313']);
        Payment::create(['code' => '710', 'name' => 'Адресная социальная помощь отдельным категориям граждан на газификацию жилого помещения (юрлица) ППКО – Кузбасса от 15.05.2020 № 285 ',                                                            'kbk' => '88810030230070210323']);
        Payment::create(['code' => '720', 'name' => 'Адресная социальная помощь отдельным категориям граждан на газификацию жилого помещения (физлица) ППКО – Кузбасса от 15.05.2020 № 285 ',                                                           'kbk' => '88810030230070210321']);
    }
}
